newwms_gift/src/Enums/ОбработчикиОфлайнОборудования/ОбработчикиОфлайнОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОбработчикиОфлайнОборудования</name>
  <enumValues>
    <name>Обработчик1СККМОфлайн</name>
  </enumValues>
  <enumValues>
    <name>Обработчик1СЭвоторККМОфлайн</name>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолККМОфлайн</name>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМККМОфлайн</name>
  </enumValues>
  <enumValues>
    <name>Обработчик1СККМED</name>
  </enumValues>
</mdclass:Enum>

newwms_gift/src/CommonModules/МенеджерОфлайнОборудованияКлиентПереопределяемый/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область ПереопределяемыеПроцедурыФорм

// Функция возвращает объект обработчика драйвера по его наименованию.
//
// Параметры:
//  ОбработчикДрайвера - ПеречислениеСсылка.ОбработчикиОфлайнОборудования - ссылка на обработчик драйвера подключаемого оборудования.
//  ЗагружаемыйДрайвер  - Булево - признак, что драйвер загружаемый.
//
// Возвращаемое значение:
//  ОбщийМодуль - Используемый модуль обработчика драйвера.
//
Функция ОбработчикДрайвераОфлайнОборудования(ОбработчикДрайвера) Экспорт
	
	Результат = Неопределено;
	
	Если ОбработчикДрайвера <> Неопределено Тогда
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиОфлайнОборудования.ОбработчикАтолККМОфлайн") Тогда
			Возврат ОфлайнОборудованиеАтолККМКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиОфлайнОборудования.ОбработчикШтрихМККМОфлайн") Тогда
			Возврат ОфлайнОборудованиеШтрихМККМКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиОфлайнОборудования.Обработчик1СККМОфлайн") Тогда
			Возврат ОфлайнОборудование1СККМКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиОфлайнОборудования.Обработчик1СЭвоторККМОфлайн") Тогда
			Возврат ОфлайнОборудование1СЭвоторКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиОфлайнОборудования.Обработчик1СККМED") Тогда
			Возврат ОфлайнОборудование1СККМEDКлиент;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает наименование формы настройки.
//
// Параметры:
//  ОбработчикДрайвера  - ПеречислениеСсылка.ОбработчикиОфлайнОборудования - ссылка на обработчик драйвера подключаемого оборудования.
//
// Возвращаемое значение:
//  Строка.
//
Функция ФормаНастройки(ОбработчикДрайвера) Экспорт
	
	Результат = Неопределено;
	
	Если ОбработчикДрайвера <> Неопределено Тогда
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиОфлайнОборудования.ОбработчикАтолККМОфлайн") Тогда
			Возврат "ФормаНастройкиАтолККМОфлайн";
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиОфлайнОборудования.ОбработчикШтрихМККМОфлайн") Тогда
			Возврат "ФормаНастройкиШтрихМККМОфлайн";
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиОфлайнОборудования.Обработчик1СККМОфлайн") Тогда
			Возврат "ФормаНастройки1СККМОфлайн";
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиОфлайнОборудования.Обработчик1СЭвоторККМОфлайн") Тогда
			Возврат "ФормаНастройки1СЭвоторККМОфлайн";
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиОфлайнОборудования.Обработчик1СККМED") Тогда
			Возврат "ФормаНастройки1СККМED";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Переопределяемая процедура, вызываемая при создании формы настройки офлайн оборудования.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма обработки
//   ОфлайнОборудование - СправочникСсылка.ОфлайнОборудование - ссылка на экземпляр оборудования.
//
Процедура ФормаНастройкиОфлайнОборудованияПриОткрытии(Форма, ОфлайнОборудование) Экспорт
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая при создании формы настройки офлайн оборудования.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма обработки
//   ОфлайнОборудование - СправочникСсылка.ОфлайнОборудование - ссылка на экземпляр оборудования.
//   СохраняемыеПараметры - Структура - сохраняемые параметры оборудования
//
Процедура ФормаНастройкиОфлайнОборудованияПриСохраненииПараметров(Форма, ОфлайнОборудование, СохраняемыеПараметры) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФормойЭкземпляраОборудования

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриОткрытии".
//
// Параметры:
//  Объект - СправочникОбъект.ОфлайнОборудование - объект подключаемого оборудования.
//  ЭтаФорма - ФормаКлиентскогоПриложения - форма владелец.
//  Отказ - Булево - признак отказа.
//
Процедура ЭкземплярОфлайнОборудованияПриОткрытии(Объект, ЭтаФорма, Отказ) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПередЗакрытием".
//
//
// Параметры:
//  Объект - СправочникОбъект.ОфлайнОборудование - объект подключаемого оборудования.
//  ЭтаФорма - ФормаКлиентскогоПриложения - форма владелец.
//  Отказ - Булево - признак отказа.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ЭкземплярОфлайнОборудованияПередЗакрытием(Объект, ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПередЗаписью".
//
// Параметры:
//  Объект - СправочникОбъект.ОфлайнОборудование - объект подключаемого оборудования.
//  ЭтаФорма - ФормаКлиентскогоПриложения - форма владелец.
//  Отказ - Булево - признак отказа.
//  ПараметрыЗаписи - Структура - параметры записи оборудования.
//
Процедура ЭкземплярОфлайнОборудованияПередЗаписью(Объект, ЭтаФорма, Отказ, ПараметрыЗаписи) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПослеЗаписи".
//
// Параметры:
//  Объект - СправочникОбъект.ОфлайнОборудование - объект подключаемого оборудования.
//  ЭтаФорма - ФормаКлиентскогоПриложения - форма владелец.
//  ПараметрыЗаписи - Структура - параметры записи оборудования.
//
Процедура ЭкземплярОфлайнОборудованияПослеЗаписи(Объект, ЭтаФорма, ПараметрыЗаписи) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ОбработкаНавигационнойСсылки".
//
// Параметры:
//  Объект - СправочникОбъект.ОфлайнОборудование - объект подключаемого оборудования.
//  ЭтаФорма - ФормаКлиентскогоПриложения - форма владелец.
//  НавигационнаяСсылкаФорматированнойСтроки - НавигационнаяСсылка - навигационная ссылка.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ЭкземплярОфлайнОборудованияОбработкаНавигационнойСсылки(Объект, ЭтаФорма, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ТипОборудованияОбработкаВыбора".
//
// Параметры:
//  Объект - СправочникОбъект.ОфлайнОборудование - объект подключаемого оборудования.
//  ЭтаФорма - ФормаКлиентскогоПриложения - форма владелец.
//  ЭтотОбъект - СправочникОбъект.ОфлайнОборудование - текущий объект подключаемого оборудования.
//  Элемент - Элемент - изменяемый элемент.
//  ВыбранноеЗначение - ПеречислениеСсылка.ТипыПодключаемогоОборудования - выбранное значение.
//
Процедура ЭкземплярОфлайнОборудованияТипОборудованияВыбор(Объект, ЭтаФорма, ЭтотОбъект, Элемент, ВыбранноеЗначение) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
